In [1]:
import pandas as pd
df1=pd.DataFrame({
    'name':['harsha','priyank','adhya','kavya','krishna'],
    'marks':[98,99,97,83,70],
    'gender':['male','male','female','female','male']
})
df1

      name  marks  gender
0   harsha     98    male
1  priyank     99    male
2    adhya     97  female
3    kavya     83  female
4  krishna     70    male

## Display first 3 rows

In [3]:
df1.head(3)

      name marks  gender
0   harsha    98    male
1  priyank    99    male
2    adhya    97  female

## Display last 3 rows

In [7]:
df1.tail(3)

      name marks  gender
2    adhya    97  female
3    kavya    83  female
4  krishna    70    male

## find shape of our dataset

In [12]:
print("rows: ",df1.shape[0])
print("columns: ",df1.shape[1])

rows:  5
columns:  3

## get information about dataset

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   marks   5 non-null      object
 2   gender  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

## check null values in our dataset

In [15]:
df1.isnull().sum()

name      0
marks     0
gender    0
dtype: int64

## get statistics

In [20]:
df1.describe(include='all')

          name marks gender
count        5     5      5
unique       5     5      2
top     harsha    98   male
freq         1     1      3

## find unique values from gender column

In [21]:
df1['gender'].unique()

array(['male', 'female'], dtype=object)

## find count of unique values from gender column

In [23]:
df1['gender'].value_counts()

gender
male      3
female    2
Name: count, dtype: int64

## find total students marks between 90 and 100

In [4]:
df1[(df1['marks'] >= 90) & (df1['marks'] <= 100)]

      name  marks  gender
0   harsha     98    male
1  priyank     99    male
2    adhya     97  female

In [6]:
df1[df1['marks'].between(90,100)]

      name  marks  gender
0   harsha     98    male
1  priyank     99    male
2    adhya     97  female

## find average marks

In [10]:
print(df1['marks'].mean())
df1['marks'].sum()
df1['marks'].max()

89.4

99

## apply methods

In [16]:
def halfmarks(x):
    return x//2
#df1['half_marks']=df1['marks'].apply(halfmarks)
df1['half_marks']=df1['marks'].apply(lambda x:x//2)
df1

      name  marks  gender  half_marks
0   harsha     98    male          49
1  priyank     99    male          49
2    adhya     97  female          48
3    kavya     83  female          41
4  krishna     70    male          35

## map

In [18]:
df1['map']=df1['gender'].map({'male':1,'female':0})
df1

      name  marks  gender  half_marks  map
0   harsha     98    male          49    1
1  priyank     99    male          49    1
2    adhya     97  female          48    0
3    kavya     83  female          41    0
4  krishna     70    male          35    1

## drop columns

In [20]:
df1

      name  marks  gender  half_marks  map
0   harsha     98    male          49    1
1  priyank     99    male          49    1
2    adhya     97  female          48    0
3    kavya     83  female          41    0
4  krishna     70    male          35    1

In [22]:
df1.drop('half_marks',axis=1)

      name  marks  gender  map
0   harsha     98    male    1
1  priyank     99    male    1
2    adhya     97  female    0
3    kavya     83  female    0
4  krishna     70    male    1

In [24]:
df1.drop(['half_marks','map'],axis=1,inplace=True)

## name of columns

In [25]:
df1.columns

Index(['name', 'marks', 'gender'], dtype='object')

In [26]:
df1.index

RangeIndex(start=0, stop=5, step=1)

## sort based on marks

In [29]:
df1.sort_values(by='marks',inplace=True,ascending=False)

In [30]:
df1

      name  marks  gender
1  priyank     99    male
0   harsha     98    male
2    adhya     97  female
3    kavya     83  female
4  krishna     70    male

## filtering

In [38]:
print((df1['gender']=='male').sum())

3